{
  "beschrijving": "Uitleg van de juridische nauwkeurigheid toegepast op een punt, lijn en vlak, en de manier waarop bepaald wordt waar de wijzigingen zitten.",
  "juridische-nauwkeurigheid": 30,
  "toon-gio-schaalafhankelijk": false,
  "toon-gio-wijziging": false,
  "symbolisatie": [ "symbolisatie_punten.xml", "symbolisatie_lijnen.xml", "symbolisatie_vlakken.xml" ],
  "geometrie": [
    {
      "pad": "1. Definitie.gml",
      "beschrijving": "In onderstaande kaart wordt een GIO-versie weergegeven met vlakken, lijnen en punten.</p><p><span class=\"leestip\"></span> Selecteer <i>Juridische nauwkeurigheid</i> om te zien hoe de juridische nauwkeurigheid eruit ziet.</p><p>Het is een vertaling van het idee \"dikke pen\":<ul><li>Voor een vlak wordt de geometrie gezien als de hartlijn van de dikke pen waarmee het vlak is getekend. De dikte van de pen is even groot als de juridische nauwkeurigheid. De begrenzing van de pennenstreek is daarom de helft van de dikte aan de buitenzijde van de geometrie, en de helft aan de binnenzijde. Dit is met standaard geo-operaties uit te rekenen als <code>geometrie.<a href=\"https://shapely.readthedocs.io/en/stable/reference/shapely.buffer.html#shapely.buffer\" target=\"_blank\">buffer</a> (juridische nauwkeurigheid / 2)</code> voor de <b>buitenrand</b> en <code>geometrie.<a href=\"https://shapely.readthedocs.io/en/stable/reference/shapely.buffer.html#shapely.buffer\" target=\"_blank\">buffer</a> (- juridische nauwkeurigheid / 2)</code> voor de binnenrand van de pennenstreek. Het deel van het vlak dat binnen de binnenrand ligt wordt <b>binnengebied</b> genoemd.</li><li>Ook voor een lijn is de geometrie de hartlijn van het tekenen met de dikke pen. De helft van de dikte van de pen ligt aan de ene, de helft aan de andere kant van de lijn. De <b>buitenrand</b> is weer te berekenen met <code>geometrie.<a href=\"https://shapely.readthedocs.io/en/stable/reference/shapely.buffer.html#shapely.buffer\" target=\"_blank\">buffer</a> (juridische nauwkeurigheid / 2)</code>. De lijn zelf wordt naar analogie met het vlak als <b>binnengebied</b> beschouwd.</li><li>Voor een punt is de gemetrie het centrum van de dikke pen. De <b>buitenrand</b> is een cirkel om het punt heen, wat ook weer te berekenen is via <code>geometrie.<a href=\"https://shapely.readthedocs.io/en/stable/reference/shapely.buffer.html#shapely.buffer\" target=\"_blank\">buffer</a> (juridische nauwkeurigheid / 2)</code>. Het punt zelf wordt naar analogie met de lijn als <b>binnengebied</b> beschouwd.</li></ul>"
    }
  ],
  "wijziging": [
    {
      "was": "1. Definitie.gml",
      "wordt": "2. Wijziging.gml",
      "beschrijving": "In onderstaande kaart staan de verschillen tussen de originele GIO-versie die hierboven getoond is, en een nieuwe GIO-versie.</p><p><span class=\"leestip\"></span> Selecteer alleen <i>GIO-versies</i> en eventueel de <i>Juridische nauwkeurigheid</i> en beweeg de slider (blauwe lijn en bol) heen en weer om de verschillen tussen de versies te zien.</p><p>De bepaling neemt als uitgangspunt dat het deel van de punten, lijnen en vlakken uit de ene GIO-versie dat binnen de buitenrand van de geometrieën uit de andere GIO-versie ligt, ongewijzigd is omdat eventuele variaties in coördinaten binnen de dikte van de pen liggen. Alleen het deel dat buiten de buitenrand ligt kan gewijzigd zijn. De wijzigmarkeringen worden conservatief getekend, dus ook weer met inachtneming van de pendikte. Omdat een juridische wijziging altijd veel groter zal zijn dan de pendikte (anders had de opsteller wel een dunnere pen gebruikt), is het niet zo erg dat de wijzigmarkeringen iets kleiner zijn. Het belangrijkste is dat ze goed zichtbaar zijn voor eenieder die de GIO-wijziging bekijkt. Dus zijn de wijzigmarkeringen:<ul><li>Het gebied uit de originele versie dat verwijderd is uit de nieuwe versie voorkomt, bestaat uit de binnengebieden uit de originele versie die liggen buiten de buitenranden van de nieuwe versie.</li><li>Het gebied uit de nieuwe versie dat toegevoegd is, bestaat uit de binnengebieden uit de nieuwe versie die liggen buiten de buitenranden van de originele versie.</li></ul>Hiermee bestaan de wijzigmarkingen uit delen van de geometrieën uit de originele of nieuwe GIO-versie. Dus een punt (lijn / vlak) als de gewijzigde geometrie ook een punt (lijn / vlak) is.</p><p><span class=\"leestip\"></span> Selecteer alleen <i>GIO-versies</i>, zet <i>Wijzigmarkeringen</i> afwisselend aan en uit. Beweeg de slider heen en weer om de relatie tussen de wijzigmarkeringen en de versies te zien. Zet de <i>Juridische nauwkeurigheid</i> aan om te zien dat de wijzigmarkeringen grenzen aan de buitenranden.</p><p>De resultaten zijn:<ul><li>Het rechter vlak (Vlak #1 - klik op de kaart voor info) heeft wel een gewijzigde geometrie maar de wijzigingen zijn kleiner dan de juridische nauwkeurigheid, dus de wijziging kan genegeerd worden.</li><li>Bij het linker vlak (Vlak #2) komt een stuk bij. De wijzigmarkeringen geven het toegevoegde stuk aan, behalve op de plaats waar in de originele versie al een lijn (Lijn #1) getekend was.</li><li>De twee lijnen worden verlengd. De wijzigmarkeringen tonen alleen de verlengingen, als lijnen.</li><li>Het linker punt (Punt #1) wordt een klein beetje verplaatst, maar binnen de juridische nauwkeurigheid en wordt dus als (juridisch) ongewijzigd beschouwd.</li><li>Het rechter punt (Punt #2) wordt verplaatst over een afstand van meer dan de juridische nauwkeurigheid. De wijzigmarkeringen geven zowel de originele als de nieuwe positie aan.</li></ul>"
    },
    {
      "was": "3. Norm.gml",
      "wordt": "4. Norm wijziging.gml",
      "beschrijving": "Als het GIO een norm of GIO-delen bevat, dan moet een verandering van normwaarde of GIO-deel meegenomen worden in de wijzigmarkeringen. Of en hoe de wijzigmarkeringen gegroepeerd worden is een implementatiekeuze. Deze software groepeert de wijzigingsmarkeringen per nieuwe waarde voor de normwaarde of GIO-deel.</p><p><span class=\"leestip\"></span> Selecteer alleen <i>GIO-versies</i> en beweeg de slider heen en weer om de originele en nieuwe versie met een norm te zien. Klik op een vlak/lijn/punt om de normwaarde te zien.</p><p>De wijzigmarkeringen worden op een vergelijkbare manier bepaald als bij een GIO met alleen geometrie en bestaan uit:<ul><li>Het gebied uit de originele versie dat verwijderd is uit de nieuwe versie voorkomt, bestaat uit de binnengebieden uit de originele versie die liggen buiten de buitenranden van de nieuwe versie.</li><li>Per waarde voor de norm/GIO-deel: het gebied uit de nieuwe versie dat de geselecteerde waarde voor de norm/GIO-deel heeft, bestaat uit de binnengebieden uit de nieuwe versie met de geselecteerde waarde die liggen buiten de buitenranden van de de gebieden met de geselecteerde waarde uit de originele versie.</li></ul>De gebieden met de geselecteerde waarde uit de originele versie die in de nieuwe versie die waarde niet meer hebben hoeven niet apart bepaald te worden: het levert dezelfde wijzigingsmarkeringen op die mogelijk anders gegroepeerd zijn.</p><p><span class=\"leestip\"></span> Selecteer alleen <i>GIO-versies</i>, zet <i>Wijzigmarkeringen</i> afwisselend aan en uit. Beweeg de slider heen en weer om de relatie tussen de wijzigmarkeringen en de versies te zien.</p><p>De resultaten zijn verschillend van de bepaling met alleen geometrie (het voorgaande voorbeeld):<ul><li>Het linker vlak (Vlak #2) en de lijn erdoorheen (Lijn #1) wordt als geheel als gewijzigd gemarkeerd omdat ze in de nieuwe versie dezelfde normwaarde krijgen.</li><li>Het linker punt (Punt #1) wordt ook als gewijzigd gemarkeerd vanwege de veranderde normwaarde, ook al is het punt vrijwel niet verplaatst.</li></ul>",
      "symbolisatie": [ "norm_symbolisatie_punten.xml", "norm_symbolisatie_lijnen.xml", "norm_symbolisatie_vlakken.xml" ]
    },
    {
      "was": "5. Norm aaneengesloten.gml",
      "wordt": "6. Norm aaneengesloten gewijzigd.gml",
      "beschrijving": "De groepering van wijzigmarkeringen had ook anders gedaan kunnen worden. Deze software groepeert (als het GIO een norm of GIO-delen bevat) per waarde van de norm of naam van het GIO-deel. Dat geeft voor aaneengesloten gebieden met één wijzigmarkering aan waar een nieuwe waarde geldt, maar maakt onderscheid tussen de verschillende waarden.</p><p><span class=\"leestip\"></span> Selecteer alleen <i>GIO-versies</i> en beweeg de slider naar links om de nieuwe normwaarde te zien (de originele is voor alle vlakken gelijk). Zet <i>Wijzigmarkeringen</i> aan en uit om de aaneengesloten wijzigmarkeringen te zien.</p><p>Er is juridisch geen bezwaar om wijzigmarkeringen te maken voor alle gewijzigde vlakken samen - dat zou één wijzigmarkering opleveren waar niet goed op te zien is dat er meerdere nieuwe normwaarden zijn. Of om wijzigmarkeringen per vlak te maken - dat levert veel wijzigmarkeringen op die de samenhang (één nieuwe waarde) tussen de wijzigingen niet goed laat zien. Het kan waardevol zijn voor BG-software om over verschillende algoritmen voor het bepalen van wijzigmarkeringen te beschikken.</p><p>Overigens laat dit voorbeeld ook zien hoe de samenvoeging van gebieden gedaan wordt om voor vlakken die net niet goed aansluiten toch één wijzigmarkering te verkrijgen.</p><p><span class=\"leestip\"></span>Selecteer alleen <i>GIO-versies</i> en zoom in om de niet-aansluitende vlakken te zien. Zet de <i>Wijzigmarkeringen</i> aan om te zien dat de wijzigmarkeringen toch maar uit drie vlakken bestaan. Klik op het onderstaande vraagteken voor de gedetailleerde beschrijving van de bepaling.",
      "symbolisatie": "norm_symbolisatie_vlakken.xml"
    }
  ]
}
