{
	"beschrijving": "Demonstratie van het belang van teken-nauwkeurigheid voor het mutatiemechanisme van GIO's.</p><p>STOP kent een geo-renvooimechanisme voor het doorgeven van een wijziging in een GIO. Daarbij wordt aangegeven welke onderdelen uit de originele versie van de GIO komen te vervallen, en welke nieuwe GIO_Locaties in de nieuwe versie worden geïntroduceerd. Daarnaast is aangegeven in welke gebieden wijzigingen zijn opgetreden. Fluctuaties in geometrie die kleiner is dan de teken-nauwkeurigheid worden daarbij genegeerd.",
    "geometrie": [
        {
            "pad": "Originele versie.gml",
			"beschrijving": "Stel dat het bevoegd gezag een GIO heeft opgesteld en daarin twee gebieden heeft aangegeven met een vrij grove beoogde nauwkeurigheid. Hoewel de gebieden met een \"dikke stift\" zijn ingetekend, heeft de software toch tot op groot detailniveau de gewenste vorm technisch weten vast te leggen, door alle bogen op dezelfde manier en met hoge precisie om te zetten in een (technisch beter te hanteren) veelhoek.",
			"symbolisatie": "vlakken_symbolisatie.xml"
        },
        {
            "pad": "Gewijzigde versie.gml",
			"beschrijving": "Bij het wijzigen van een onderdeel van de GIO zal een mens met dezelfde dikke stift een nieuwe vorm aangeven. De software zal de omzetting van cirkel naar veelhoek opnieuw uitvoeren maar met andere beginparameters. Daardoor sluite het gewijzigde gebied niet meer goed aan op het ongewijzigde gebied als sterk ingezoomd wordt. De kleine verschillen die dan zichtbaar worden zijn juridisch niet beoogd.",
			"symbolisatie": "vlakken_symbolisatie.xml"
        }
    ],
	"wijziging": [
        {
            "was": "Originele versie.gml", 
            "wordt": "Gewijzigde versie.gml", 
			"teken-nauwkeurigheid": 20000,
            "toon": false,
			"beschrijving": "STOP kent een geo-renvooimechanisme voor het doorgeven van een wijziging in een GIO. Daarbij wordt aangegeven welke GIO-<a href=\"https://koop.gitlab.io/STOP/voorinzage/standaard-preview-b/geo_xsd_Element_geo_Locatie.html\">Locaties</a> uit de originele versie van de GIO komen te vervallen, en welke nieuwe GIO_Locaties in de nieuwe versie worden geïntroduceerd. Daarnaast is aangegeven in welke gebieden wijzigingen zijn opgetreden. In dit geval is het ongewijzigde gebied dus geen onderdeel van de GIO-wijziging, maar de oude en nieuwe vorm van het gewijzigde gebied wel. En de teken-onnauwkeurigheden op de afscheiding zouden niet als wijziging gemarkeerd moeten worden, omdat ze juridisch niet relevant zijn. Dat kan de software doen door details kleiner dan de teken-nauwkeurigheid te negeren."
        }
    ]
}