{
	"beschrijving": "Demonstratie van het belang van teken-nauwkeurigheid voor het geautomatiseerd detecteren van juridisch signifcante wijzigingen tussen twee GIO-versies.</p><p>STOP kent een geo-renvooimechanisme voor het doorgeven van een wijziging in een GIO. Daarbij wordt aangegeven welke GIO-<a href=\"@@@STOP_Documentatie_Url@@@geo_xsd_Element_geo_Locatie.html\">Locaties</a> uit de originele versie van de GIO komen te vervallen, en welke nieuwe GIO_Locaties in de nieuwe versie worden geïntroduceerd. Daarnaast is aangegeven in welke gebieden wijzigingen zijn opgetreden. Zo'n wijziging kan onderdeel zijn van een besluit en op een juridisch correcte manier worden weergegeven. Het mechanisme kan altijd worden toegepast ongeacht de kwaliteit van de inhoud van de twee GIO-versies en de wijze waarop de GIO-wijziging bepaald is.</p><p>Maar STOP heeft ook tot doel vergaande automatisering mogelijk te maken bij het werken met besluiten en consolidaties daarvan. Bij de andere component van regelgeving - de tekst van een regeling - is daarom voor een renvooimechanisme gekozen waarbij geautomatiseerd de locatie van wijzigingen in de tekst bepaald kunnen worden, zodat een bevoegd gezag zich kan richten op het produceren van een goede tekst. Voor de goede werking is het renvooimechanisme afhankelijk van een zekere mate ven zorgvuldigheid door het bevoegd gezag bij het aanpassen van de tekst zodat de software kan herkennen welke delen van de tekst in de originele en nieuwe versie overeenkomen (technisch: behouden van de <i>wId</i>). Deze zorgvuldigheid wordt niet afgedwongen door het renvooi<i>mechanisme</i> maar is een randvoorwaarde om het te laten werken, en is dus onderdeel van de standaard.</p><p>Elke methode om op een geautomatiseerde manier wijzigingen in een GIO te kunnen vaststellen, zal om moeten kunnen gaan met onnauwkeurigheid in de manier waarop de geometrieën technisch worden vastgelegd. Elke methode vereist een vorm van zorgvuldigheid van het bevoegd gezag nij het opstellen van een GIO, en die zorgvuldigheid zal in de standaard opgenomen moeten worden. In STOP is dat: elke GIO kent een teken-nauwkeurigheid, en de GIO-locaties binnen een GIO-versie overlappen elkaar niet (met inachtnemeing van de teken-nauwkeurigheid). Deze demonstratie laat zien waarom dat nodig is.",
    "geometrie": [
        {
            "pad": "Originele versie.gml",
			"beschrijving": "Stel dat het bevoegd gezag een GIO heeft opgesteld en zeer zorgvuldig heeft gewerkt. Dat wil zeggen: een gebied is met een \"dikke stift\" ingetekend, waarbij de dikte van de stift de teken-nauwkeurigheid vormt. In sommige gevallen helpt software om een gewenste vorm technisch vast te leggen, bijvoorbeeld door een cirkel om te zetten in een (technisch beter te hanteren) veelhoek.",
			"symbolisatie": "vlakken_symbolisatie.xml"
        },
        {
            "pad": "Gewijzigde versie.gml",
			"beschrijving": "Bij het wijzigen van een onderdeel van de GIO zal een mens met dezlefde dikke stift een nieuwe vorm aangeven. Misschien dat de software de omzetting van cirkel naar veelhoek opnieuw uitvoert. Het resultaat sluit visueel misschien goed aan bij de ongewijzigde gebieden, maar als ingezoomd wordt zullen er altijd kleine verschillen zichtbaar blijven.</p><p>Het geo-renvooimechanisme vraagt om automatisering die alleen de toevoeging van de rechthoek aan de linkerzijde als wijziging signaleert, en niet de \"ruis\" die is ontstaan door kleine onnauwkeurigheden in het opnieuw tekenen of vertalen van de binnenste cirkel.</p><p>De vraag is: aan welke eisen moet de GIO voldoen zodat er een geautomatiseerde bepaling mogelijk is?",
			"symbolisatie": "vlakken_symbolisatie.xml"
        }
    ]
}