{
  "beschrijving": "Ook kwantitatieve normwaarden kennen een (on)nauwkeurigheid, maar die speelt in de (juridische) praktijk geen rol, als STOP-gebruikende software tenminste deze waarden altijd als getal behandelen.",
  "juridische-nauwkeurigheid": 50,
  "toon-gio-schaalafhankelijk": false,
  "toon-gio-wijziging": false,
  "symbolisatie": "symbolisatie.xml",
  "geometrie": [
    {
      "pad": "1. Kwantitatieve norm.gml",
      "beschrijving": "Tot nu toe is alleen ingegaan op de nauwkeurigheid van de geometrie. Maar er is nog een bron van onnauwkeurigheid: de normwaarde als een GIO een kwantitatieve norm bevat. De bron van onnauwkeurigheid is daarbij <i>niet</i> het overnemen van een normwaarde naar een volgende GIO-versie. Het is voor een opsteller van een GIO-versie geen probleem om een normwaarde te kopiëren. De software zal in het algemeen ook de vertaling van de interne representatie van de normwaarde (bijvoorbeeld als double precision floating point) naar tekst (GML) en omgekeerd exact kunnen uitvoeren. De systematische onnauwkeurigheid die er nog is treedt pas op bij het 15<sup>e</sup> cijfer van een getal of (als de software met minder precisie werkt) bij het 6<sup>e</sup> cijfer. Het is niet goed voorstelbaar dat voor juridische normen zo'n groot aantal significante cijfers nodig zijn om twee verschillende normwaarden van elkaar te onderscheiden. De (on)nauwkeurigheid in de normwaarde zal daarom geen rol spelen bij de bepaling van de GIO-wijziging.</p><p>Dat wil zeggen: zolang alle software in de keten de kwantitatieve normwaarde ook echt als getal hanteren, zodat 1, 1.0 en 1.0000000000000000001 allen als het getal 1 gelezen worden. Dat geldt zowel voor de <code>kwantitatieveNormwaarde</code> uit een GIO als voor de getallen die in de symbolisatie van de norm staan.</p><p>Deze software leest de <code>kwantitatieveNormwaarde</code> in als getal en rekent daar ook mee. Voor de symbolisatie wordt een <a href=\"https://github.com/NieuwlandGeo/SLDReader\">gedownload script</a> gebruikt die waarden in de symbolisatie ook omzet naar getallen. Onderstaande kaart toont dat: de symbolisatie kent symbolen voor de waarden in [90..110] en voor waarden in [110..130], en de waarden in de GIO-versie hebben cijfers achter de komma en een 0 vooraf (zie <a href=\"https://github.com/STOPwerk/Geo-tools/tree/main/docs/Uitleg/06%20Nauwkeurigheid%20van%20normwaarden\" target=\"_blank\">bronbestanden</a>). Als niet met getallen maar met tekstvergelijking gerekend werd zouden hier geen twee gebieden te zien zijn."
    }
  ],
  "wijziging": [
    {
      "was": "1. Kwantitatieve norm.gml",
      "wordt": "2. Kwantitatieve norm gewijzigd.gml",
      "beschrijving": "Dat deze software inderdaad een <code>kwantitatieveNormwaarde</code> als getal verwerkt is ook te zien bij de bepaling van de GIO-wijziging tussen de voorgaande GIO-versie en een GIO-versie met exact dezelfde geometrieën en exact dezelfde normwaarden (in de double precision floating point representatie), waarbij de normwaarden op een andere manier in de GML zijn opgeschreven (zie <a href=\"https://github.com/STOPwerk/Geo-tools/tree/main/docs/Uitleg/06%20Nauwkeurigheid%20van%20normwaarden\" target=\"_blank\">bronbestanden</a>). De resulterende GIO-wijziging bevat zoals verwacht geen wijzigmarkeringen."
    }
  ]
}
