{
  "beschrijving": "STOP stelt eisen aan de inhoud van de GIO-versies van een muteerbare GIO om het opstellen van een GIO-wijziging eenvoudig te houden en niet verzeild te raken in complexe geo-berekeningen. Deze kwaliteitseisen worden hier nader toegelicht.",
  "juridische-nauwkeurigheid": 50,
  "toon-gio-schaalafhankelijk": false,
  "toon-gio-wijziging": false,
  "symbolisatie": [ "symbolisatie_punten.xml", "symbolisatie_lijnen.xml", "symbolisatie_vlakken.xml" ],
  "geometrie": [
    {
      "pad": "1. Kwaliteitscontrole.gml",
      "kwaliteitscontrole": true,
      "beschrijving": "De bepaling van wijzigmarkeringen kan behoorlijk complex worden als er geen beperkingen gesteld worden aan de GIO-versies in de hele keten van het bevoegd gezag via LVBB/DSO-LV naar een adviesbureau en terug naar het bevoegd gezag. Dat treedt met name op als geometrieën elkaar gaan overlappen. Het eenvoudige algoritme dat in STOP beschreven is, en dat ook in deze software is verwerkt, kan dan niet alle wijzigingen meer detecteren. Omdat de bijzondere situaties die de complexiteit veroorzaken juridisch niets toevoegen (en soms zelfs juridisch incorrect zijn), worden de situaties in STOP verboden. Dit voorbeeld illustreert de situaties voor een GIO met norm (de symbolisatie is onafhankelijk van de normwaarde)</p><p><span class=\"leestip\"></span> Selecteer <i>Juridische nauwkeurigheid</i> om de overlap van de geometrieën met inachtneming van de juridische nauwkeurigheid te zien.</p><p><span class=\"leestip\"></span> Lees verder onder de kaart met de GIO-versie en bekijk de situaties per geometrie in de tweede kaart door op de geometrie te klikken.</p><p>"
    }
  ],
  "wijziging": [
    {
      "was": "2. Overlappende geometrie.gml",
      "wordt": "3. Misbare geometrie weggehaald.gml",
      "beschrijving": "Om te illustreren dat wijzigingen van de (bijna) overlappende geometrieën niet gedetecteerd worden, wordt het verschil tussen de voorgaande GIO-versie (zonder normwaarde) en een GIO-versie met vereenvoudigde geometrie bepaald met het eenvoudige algoritme. Het laat zien dat er juridisch geen wijziging is - alle gebieden waar de juridische regels in de eerste versie gelden, gelden ze (binnen de juridische nauwkeurigheid) ook in de tweede versie. Maar als naar de GIO-locaties wordt gekeken dan is de inhoud sterk verschillend.</p><p><span class=\"leestip\"></span> Selecteer alleen <i>GIO-versies</i> en beweeg de slider heen en weer om de twee GIO-versies te zien."
    },
    {
      "was": "3. Misbare geometrie weggehaald.gml",
      "wordt": "4. Ongewijzigde geometrieën.gml",
      "beschrijving": "Iets dat ook lastig te detecteren is, is of de nieuwe GIO-versie dezelfde geometrie (al dan niet met kleine wijzigingen) bevat als de originele versie. Als de geometrieën van een locatie in beide versies vrijwel gelijk zijn (en ook een eventuele normwaarde of GIO-deel), dan zal er geen wijzigingmarkering voor de geometrie worden bepaald en zou de geometrie niet doorgegeven hoeven te worden in de GIO-wijziging. Een eenvoudig algoritme voor de GIO-wijziging bepaling heeft geen andere keus dan hier niet naar te kijken en ook in dit geval de nieuwe geometrie door te geven.</p><p>Er is één manier om aan het algoritme door te geven dat een geometrie niet gewijzigd is: door de basisgeometrie-id gelijk te houden in beide versies van het GIO. Dat is dan ook de eis in STOP voor muteerbare GIO's. Dit voorbeeld voldoet daar niet aan.</p><p><span class=\"leestip\"></span> Selecteer alleen <i>GIO-versies</i> en beweeg de slider heen en weer om de gelijkheid van de twee GIO-versies te zien. Selecteer <i>LocatieMutaties (geen revisie)</i> om te zien dat alle geometrieën in de GIO-wijziging meegenomen worden."
    },
    {
      "was": "5. Multigeometrie.gml",
      "wordt": "6. Multigeometrie gewijzigd.gml",
      "beschrijving": "De GIO-locatie is de kleinste muteerbare eenheid binnen een GIO. Het is geen eis dat de locatie uit een enkele geometrie bestaat. Als regels over gemeentes gaan, dan is de gemeente Baarle-Nassau een kleinste muteerbare eenheid, maar voor een adequate geo-modellering zijn meerdere geometrieën nodig. Het is echter af te raden (en onwenselijk) om slechts één locatie in een GIO te gebruiken en alle geometrieën daarin te stoppen, zoals in dit voorbeeld. Bij wijziging moeten opnieuw alle geometrieën worden meegegeven, ook al wijzigt er maar één. De GIO-wijziging toont dan niet alleen de wijziging waarover besloten is, maar ook weer opnieuw alle andere geometrieën.</p><p><span class=\"leestip\"></span> Selecteer <i>GIO-versies</i> en <i>Wijzigmarkeringen</i> en beweeg de slider heen en weer om het kleine verschil tussen de twee GIO-versies te zien. Selecteer <i>LocatieMutaties (geen revisie)</i> om te zien dat alle geometrieën in de GIO-wijziging meegenomen moeten worden.",
      "toon-gio-wijziging": true,
      "beschrijving_toon": "<span class=\"leestip\"></span> De kleine wijziging kan alleen bekeken worden door eerst in te zoomen."
    }
  ]
}
