{
	"beschrijving": "Demonstratie van het gebruik van teken-nauwkeurigheid bij het opstellen en beoordelen van een GIO.",
    "geometrie": [
        {
            "pad": "technische_nauwkeurigheid.gml",
			"beschrijving": "Bij het samenstellen van een GIO bepaalt de technische nauwkeurigheid hoe gedetailleerd een GIO op een kaart weergegeven kan worden. Hoe nauwkeuriger een GIO is ingetekend of berekend, hoe verder de weergave ingezoomd kan worden. Deze GIO bevat twee cirkels die als veelhoek zijn getekend, links met een technische nauwkeurigheid van 1 decimeter (overeenkomstig de achtergrondkaart) en rechts 5 meter.",
			"symbolisatie": "vlakken_symbolisatie.xml"
        },
        {
            "pad": "juridische_teken-nauwkeurigheid.gml",
			"beschrijving": "De juridische betekenis van de inhoud van een GIO is niet gerelateerd aan de technische nauwkeurigheid of detaillering, maar aan de aard van de juridische regel. Als het bijvoorbeeld over iets grootschaligs als toestaan of verbieden van woningbouw gaat, dan zal de grens ervan niet op de decimeter nauwkeurig zijn afgewogen. De opsteller van de regel heeft misschien wel een dikke stift gepakt en een grens getekend op een kaartschaal waarbij de stift een dikte van meters heeft - in STOP heet dat de teken-nauwkeurigheid. Dat gebied ziet er met een hoge technische nauwkeurigheid (links, 1 technische decimeter) op de kaart beter uit dan een grover getekende versie (rechts, 5 meter technische nauwkeurigheid). Maar juridisch maakt dat geen verschil; de lege ruimtes in de rechter figuur zullen niet opgevat worden als gebieden waar opeens een andere regel gaat gelden.",
			"symbolisatie": "vlakken_symbolisatie.xml"
        },
        {
            "pad": "uitwerking_vlakken.gml",
			"beschrijving": "Een inhoudelijk correcte GIO waarvan de geometrieën gebieden (vlakken) zijn, zal daarom GIO-<a href=\"@@@STOP_Documentatie_Url@@@geo_xsd_Element_geo_Locatie.html\">Locaties</a> hebben die voldoende afstand tot elkaar hebben, en die groter zijn dan de teken-nauwkeurigheid. Dat is na te gaan.</p><p>Overigens zullen niet alle locaties expliciet ingetekend zijn. Soms wordt een bestaande geometrie overgenomen, bijvoorbeeld als het ambtsgebied van een gemeente gebruikt wordt. Onderdeel van de (multi-)geometrie van zo'n locatie kunnen geometrieën zijn die kleiner zijn dan de teken-nauwkeurigheid. Dat is voor de geautomatiseerde bepaling van een GIO-wijziging (althans in deze geo-tools) niet erg zolang de (multi-)geometrie van locatie niet uitsluitend uit dat soort geometrieën bestaat. Het is nog steeds een probleem als vlakken van dezelfde locatie elkaar teveel overlappen.</p><p>In deze GIO staan als voorbeeld: vlakken die elkaar binnen de teken-nauwkeurigheid overlappen (links), vlakken die elkaar teveel teken-nauwkeurigheid overlappen (midden), een locatie met meerdere geometrieën die niet allemaal groot genoeg zijn (rechts boven), een te kleine locatie (rechts onder). Ter vergelijking staat uiterst rechts onder een locatie die vrijwel even groot is als de teken-nauwkeurigheid.",
			"symbolisatie": "vlakken_symbolisatie.xml",
			"teken-nauwkeurigheid": 20000
        },
        {
            "pad": "uitwerking_punten.gml",
			"beschrijving": "Een inhoudelijk correcte GIO waarvan de geometrieën punten zijn, zal punten hebben die meer dan de teken-nauwkeurigheid van elkaar af staan. Als de geometrie van een GIO-<a href=\"@@@STOP_Documentatie_Url@@@geo_xsd_Element_geo_Locatie.html\">Locatie</a> uit meerdere punten bestaat, geldt dat ook voor de onderlinge afstand tussen de punten. Als van het GIO bekend is dat er geen overlappende (te dicht bij elkaar staande) punten zijn, dan kan aan de hand van de onderlinge afstand van de punten een bovengrens aan de gebruikte teken-nauwkeurigheid bepaald worden.</p><p>In deze GIO staan als voorbeeld: punten uit verschillende locaties met een onderlinge afstand groter dan de teken-nauwkeurigheid (links), punten uit verschillende locaties met een onderlinge afstand kleiner dan de teken-nauwkeurigheid (midden), een locatie met meerdere punten die onderling te dicht bij elkaar staan (rechts).",
			"symbolisatie": "punten_symbolisatie.xml",
			"teken-nauwkeurigheid": 100
        },
        {
            "pad": "uitwerking_lijnen.gml",
			"beschrijving": "Een inhoudelijk correcte GIO waarvan de geometrieën lijnen zijn, zal lijnen hebben die meer dan de teken-nauwkeurigheid van elkaar af liggen. Hierbij moet <i>lijnen</i> gelezen worden als één of meer onderling verbonden lijnstukken. Daarnaast zullen de lijnen niet te klein zijn, dus een uitgestrektheid hebben die groter is dan de de teken-nauwkeurigheid. Als van het GIO bekend is dat er geen overlappende (te dicht bij elkaar liggende) lijnen zijn, dan kan aan de hand van de onderlinge afstand van de lijnen een bovengrens aan de gebruikte teken-nauwkeurigheid bepaald worden.</p><p>Of de lijnen in een GIO hieraan voldoen is op basis van de lijnstukken alleen niet vast te stellen. Verbonden lijnstukken hebben een onderlinge afstand van nul; omdat rekening gehouden moet worden met onnauwkeurigheden bij het \"tekenen\" wordt het criterium dat lijnstukken verbonden zijn als ze minder dan de teken-nauwkeurigheid van elkaar af liggen. Maar dat is ook precies het criterium voor lijnen die te dicht bij elkaar liggen. Deze geo-tools gaan er daarom van uit dat een lijn (alle verbonden lijnstukken) tot één GIO-<a href=\"@@@STOP_Documentatie_Url@@@geo_xsd_Element_geo_Locatie.html\">Locatie</a> behoort. Een GIO-locatie mag meerdere lijnen omvatten. De lijnen/lijnstukken van verschillende GIO-locaties moeten dan verder dan de teken-nauwkeurigheid van elkaar af liggen.</p><p>In deze GIO staan als voorbeeld: lijnen uit verschillende locaties met een onderlinge afstand groter dan de teken-nauwkeurigheid (links) waaronder een locatie met meerdere lijnstukken die onderling verbonden zijn of te dicht bij elkaar liggen, lijnen uit verschillende locaties met een onderlinge afstand kleiner dan de teken-nauwkeurigheid (midden), een te kleine locatie (midden onder) en een locatie met meerdere lijnstukken die overlapt met een andere locatie (rechts). Uiterst rechtsonder staat een lijnstuk dat net groter is dan de teken-nauwkeurigheid.",
			"symbolisatie": "lijnen_symbolisatie.xml",
			"teken-nauwkeurigheid": 100
        }
    ]
}